/*Напишите программу, в которой класс создается на основе двух ин-
терфейсов. В каждом из интерфейсов объявлено текстовое свойство
с одним и тем же названием, доступное только для чтения. В классе вы-
полнить общую (неявную) реализацию свойства, а также явную спе-
циализацию свойства для каждого из интерфейсов. Проверьте значение
свойства для объекта класса, выполнив ссылку на объект через объект-
ную переменную и интерфейсные переменные.*/

using System;

namespace Homework_8
{
    internal class Program
    {
        static void Main(string[] args)
        {
        }
    }
}
